# Primitive Data Type
# Numver , Boolean , String

# Non - Primitive Sata Tyoe / Collection / Data Structure ข้อมูลฃนิดพื้นฐาน
# List , Tuple , Set  , Dicrionary 

# Data Type จะเอามาใช้กับการเขียนโปรแกรมในเรื่องของ ตัวแปร พารามิเตอร์ ฟังก์ฃั่น เมธอด

# ------- LIST ข้อมูลหลายข้อมูล คนละฃนิด ซ้ำกันได้ และมีลำดับ อีกทั้งแก้ไขได้ด้วย -------
        #    0   1    2    3    4         5
my_list1 = [10, 20, True, 10, 'SAU', [20, 'IOT']]               
        #    6   5   4     3    2          1 ค่าติดลบ
# ------- Tuple ข้อมูลหลายข้อมูล คนละฃนิด ซ้ำกันได้ และมีลำดับ แก้ไขไม่ได้ได้ด้วย -------
        #    0   1    2    3    4         5
my_tuple = (10, 20, True, 10, 'SAU', (20, 'IOT'))
        #    6   5   4     3    2          1 ค่าติดลบ
# ------- Set คือ ช้อมูลหลายข้อมูล คนละชนิด ซ้ำกันไม่ได้ (หากซ้ำถือว่าเป็นตัวเดียวกัน) และไม่มีลำดับ และแก้ไขไม่ได้ และเพิ่ม ลดได้-------
my_set = (10, 20, True, 10, 'SAU', (20, 'IOT'))

# +++++ ictionary คือข้อมูลหลายข้อมูลที่  ที่เป็น key:value แก้ไขได้ด้วย ไม่มีลำดับ ซ้ำได้ -----
# key เป็น String/Integer ส่วน value เป็ณอหยังก็ได้ (number. sting.Boolean.list.setdictioary)
my_dict1 = {'name' : 'mod', 'age':30, 555:999, 'flag':True, 'wow':[10,20,30]}
        
